apps/perf/artillery/upload.yml
config:
  target: "http://localhost:4000"
  processor: "./helpers.cjs"
  # Low sustained rate — upload is I/O-heavy (file write + DB write + async
  # Sharp resize) and realistic event-day volume is not high.
  phases:
    - name: Warm-up
      duration: 20
      arrivalRate: 1
    - name: Sustained
      duration: 120
      arrivalRate: 5
  ensure:
    p99: 2500
    # Each VU gets its own unique spoofed IP so its 12/min rate-limit budget
    # is never shared with another VU. 429s should be 0%; any that appear
    # indicate the X-Forwarded-For header is not reaching the API (e.g. a
    # proxy is stripping or overwriting it).
    maxErrorRate: 2

scenarios:
  - name: "Photo upload"
    beforeScenario: "setUploadVars"
    flow:
      - post:
          url: "/v/{{ uploadToken }}/photos"
          beforeRequest: "attachMultipart"